verifyConnectivity -type all -error 1000 -warning 50
verify_drc

saveDesign ./DBS/CHIP_nanoRoute.inn
